selenium/feature_tests/src/test/resources/testfiles/genricReportingUAE/PTSuploadSuccess.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxf="http://cxf.component.camel.apache.org/">
    <soapenv:Header />
    <soapenv:Body>
        <n1:envelope xmlns:n1="http://www.sap.com/sap_ich4ls/" xmlns:prx="urn:sap.com:proxy:Y21:/1SAI/TAS8FB8FF2B37F00B51AA2D:740" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
            <message date="2023-03-02" time="11:18:44">
                <id>42010AEECDE55FDD8D98936BE6F3A1EE</id>
            </message>
            <sender agency="GS1" scheme="GLN">0355801000002</sender>
            <recipients>
                <id agency="SAP" scheme="RegReport">RR_SA_ICH_PTS</id>
            </recipients>
            <content encoding="XML" format="ATTP" type="GenericReporting" version="1.0">
                <ATTPGRDocument>
                    <GRHeader>
                        <GRHeaderBase>
                            <ReceiverId>ReceiverId</ReceiverId>
                            <InstanceId>InstanceID</InstanceId>
                            <DateTime>2023-03-02T11:18:44Z</DateTime>
                            <VariantName>RR_SA_PTS</VariantName>
                            <VariantVersion>1</VariantVersion>
                        </GRHeaderBase>
                        <ContentList>
                            <Content type="Event">
                                <ContentItem id="1-OBSERVE">
                                    <ContentItemSection type="Details">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtBizlocGln">6823034800002</attribute>
                                            <attribute id="sttpEvtBizlocGlnExt">01</attribute>
                                            <attribute id="sttpEvtEvttime">20230302103554.0000000</attribute>
                                            <attribute id="sttpEvtEvttzoneoffset">+01:00</attribute>
                                            <attribute id="sttpEvtReadpntGln">6823034800002</attribute>
                                            <attribute id="sttpEvtReadpntGlnExt">01</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                    <ContentItemSection type="SourceDestination">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtSdrSdCat">1</attribute>
                                            <attribute id="sttpEvtSdrSdGln">4063973002989</attribute>
                                            <attribute id="sttpEvtSdrSdGlnExt">01</attribute>
                                            <attribute id="sttpEvtSdrSdType">urn:epcglobal:cbv:sdt:owning_party</attribute>
                                        </ContentItemSectionItem>
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtSdrSdCat">1</attribute>
                                            <attribute id="sttpEvtSdrSdGln">4063973002989</attribute>
                                            <attribute id="sttpEvtSdrSdGlnExt">01</attribute>
                                            <attribute id="sttpEvtSdrSdType">urn:epcglobal:cbv:sdt:location</attribute>
                                        </ContentItemSectionItem>
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtSdrSdCat">2</attribute>
                                            <attribute id="sttpEvtSdrSdGln">6285148000011</attribute>
                                            <attribute id="sttpEvtSdrSdGlnExt">0</attribute>
                                            <attribute id="sttpEvtSdrSdType">urn:epcglobal:cbv:sdt:owning_party</attribute>
                                        </ContentItemSectionItem>
                                        <ContentItemSectionItem>
                                            <attribute id="sttpEvtSdrSdCat">2</attribute>
                                            <attribute id="sttpEvtSdrSdGln">6285148000011</attribute>
                                            <attribute id="sttpEvtSdrSdGlnExt">0</attribute>
                                            <attribute id="sttpEvtSdrSdType">urn:epcglobal:cbv:sdt:location</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                    <ContentItemSection type="BusinessTransaction">
                                        <ContentItemSectionItem>
                                            <attribute id="sttpTrnBizttype">urn:epcglobal:cbv:btt:desadv</attribute>
                                            <attribute id="sttpTrnTrncode">urn:epcglobal:cbv:bt:4063973002989:SA_DESADV</attribute>
                                        </ContentItemSectionItem>
                                    </ContentItemSection>
                                </ContentItem>
                            </Content>
                        </ContentList>
                    </GRHeader>
                    <GRBody>
                        <ObjContentList>
                            <ObjContent type="LotRefList">
                                <ObjContentGroup>
                                    <ObjCode id="010406397300099210DKSA010801" type="LGTIN" dateManuf="2023-03-02" dateExp="2024-03-01" />
                                </ObjContentGroup>
                            </ObjContent>
                            <ObjContent type="ObjHierarchy">
                                <ObjContentGroup>
                                    <ObjCode id="objcode1" type="SGTIN" lotRef="SFDAQOSAIBI1817" parentId="00012233400000001370" packLevel="2" />
                                    <ObjCode id="objcode2" type="SGTIN" lotRef="SFDAQOSAIBI1817" parentId="00012233400000001370" packLevel="2" />
                                </ObjContentGroup>
                            </ObjContent>
                        </ObjContentList>
                    </GRBody>
                </ATTPGRDocument>
            </content>
        </n1:envelope>
    </soapenv:Body>
</soapenv:Envelope>